export const mbtiTypes = [
  {
    type: "ISTJ",
    name: "청렴한 관리자",
    description:
      "ISTJ 유형은 실용적이고 신뢰할 수 있으며, 체계적이고 조직적인 접근을 통해 일관성 있게 목표를 달성하는 데 뛰어난 능력을 보입니다. 이들은 규칙과 절차를 중시하며, 주어진 역할과 책임을 성실히 수행합니다. 문제를 해결할 때 논리적이고 분석적인 사고를 바탕으로 접근하며, 자신의 일에 대해 높은 기준을 가지고 있습니다. 또한, 현실적인 관점을 중요시하며, 주변 환경을 안정적으로 유지하는 것을 선호합니다."
  },
  {
    type: "ISFJ",
    name: "용감한 수호자",
    description:
      "ISFJ 유형은 세심하고 배려가 깊으며, 타인의 필요를 우선시하여 조용히 지원하는 성향을 가지고 있습니다. 이들은 전통과 안정성을 중시하며, 자신의 역할을 성실히 수행하는 데 큰 만족을 느낍니다. 사람들과의 관계를 소중히 여기며, 주변 사람들을 돕고 그들의 행복을 위해 노력합니다. 또한, 안정적인 환경을 유지하고자 하며, 자신의 책임을 다하며 세심하게 주변을 살피는 성향을 가지고 있습니다."
  },
  {
    type: "INFJ",
    name: "이상적인 선도자",
    description:
      "INFJ 유형은 깊은 통찰력과 강한 직관을 바탕으로 사람들을 이끌며, 이상적인 목표를 위해 헌신하는 경향이 있습니다. 이들은 인간의 본성과 사회적 문제에 대한 깊은 이해를 바탕으로, 의미 있는 변화를 추구하고자 하는 강한 열망을 가지고 있습니다. 자신의 가치와 원칙을 중시하며, 다른 사람들에게 긍정적인 영향을 미치기 위해 노력합니다. 또한, 개인의 성장과 발전을 지원하는 데 큰 관심을 가지고 있습니다."
  },
  {
    type: "INTJ",
    name: "전략가",
    description:
      "INTJ 유형은 철저한 분석과 계획을 통해 장기적인 목표를 설정하고 이를 달성하는 것을 선호합니다. 이들은 논리적이고 독립적인 사고를 바탕으로 복잡한 문제를 해결하며, 혁신적인 아이디어를 통해 새로운 방향을 제시하는 것을 좋아합니다. 전략적 사고와 분석 능력을 활용하여 문제를 해결하고, 목표를 달성하기 위해 체계적인 접근을 합니다. 자신이 설정한 목표를 이루기 위해 필요한 자원을 계획적으로 관리합니다."
  },
  {
    type: "ISTP",
    name: "장인",
    description:
      "ISTP 유형은 문제를 해결하기 위해 실용적이고 유연한 접근을 하며, 실험과 경험을 통해 배우는 것을 좋아합니다. 이들은 독립적이고 분석적인 성향으로, 자율적인 환경에서 창의적으로 문제를 해결하는 데 뛰어난 능력을 보입니다. 손재주가 뛰어나며, 기술적 문제를 다루는 데 능숙합니다. 또한, 변화하는 상황에 적응하며 문제를 신속하게 해결하는 것을 중요시합니다."
  },
  {
    type: "ISFP",
    name: "모험가",
    description:
      "ISFP 유형은 자유롭고 개성 있는 삶을 추구하며, 현재의 순간을 즐기고 실용적인 방식으로 표현합니다. 이들은 아름다움과 예술적 표현을 중요시하며, 주변 사람들과 조화롭게 지내는 것을 선호합니다. 감각적이고 실용적인 성향으로, 주변 환경에서 긍정적인 영향을 미치고자 하며, 개인적인 자유와 자율성을 중시합니다. 또한, 자신만의 개성과 취향을 표현하며 삶을 즐기고자 합니다."
  },
  {
    type: "INFP",
    name: "중재자",
    description:
      "INFP 유형은 이상적이며 깊은 감정을 가지고 있으며, 자신의 가치와 원칙에 따라 세상을 변화시키고자 하는 강한 열망을 가지고 있습니다. 이들은 감성적이고 직관적인 성향으로, 사람들의 잠재력을 발견하고 긍정적인 영향을 미치는 것을 중시합니다. 자신의 가치와 목표에 충실하며, 인간의 본성과 사회적 문제에 대해 깊은 이해를 가지고 있습니다. 또한, 창의적인 방법으로 문제를 해결하고 새로운 아이디어를 제안하는 것을 좋아합니다."
  },
  {
    type: "INTP",
    name: "사색가",
    description:
      "INTP 유형은 논리적이고 분석적인 사고를 통해 세상의 원리를 이해하고 새로운 이론을 개발합니다. 이들은 복잡한 문제를 해결하고, 지적 호기심을 충족시키는 것에 큰 가치를 두며, 창의적인 접근 방식으로 독립적으로 작업하는 것을 선호합니다. 이론적이고 철학적인 주제에 대해 깊이 탐구하며, 문제를 체계적으로 분석하고 새로운 해결책을 제시하는 것을 좋아합니다. 또한, 자유롭고 비판적인 사고를 통해 혁신적인 아이디어를 발전시키는 데 관심이 많습니다."
  },
  {
    type: "ESTP",
    name: "기업가",
    description:
      "ESTP 유형은 즉각적인 행동을 선호하며, 현실적이고 실용적인 해결책을 통해 문제를 신속히 해결합니다. 이들은 에너지가 넘치고, 활동적인 성향으로 새로운 도전을 즐기며, 실용적인 방식으로 문제를 해결하는 데 능숙합니다. 환경의 변화에 민첩하게 반응하며, 주변 사람들과의 상호작용에서 높은 에너지를 발휘합니다. 또한, 직관적이고 실용적인 접근으로 빠르게 결과를 도출하는 것을 중요시합니다."
  },
  {
    type: "ESFP",
    name: "연예인",
    description:
      "ESFP 유형은 사람들과 함께하는 것을 즐기며, 현재의 순간을 최대한 활용하여 즐겁고 활기찬 삶을 살고자 합니다. 이들은 사교적이고 활동적인 성향으로, 주변 사람들에게 긍정적인 에너지를 주며, 즉흥적이고 실용적인 방식으로 삶을 즐깁니다. 감각적이고 실용적인 접근을 통해 주변 환경을 즐기며, 사람들과의 관계에서 행복과 만족을 찾습니다. 또한, 새로운 경험과 모험을 추구하며 삶을 풍부하게 만드는 것을 좋아합니다."
  },
  {
    type: "ENFP",
    name: "활동가",
    description:
      "ENFP 유형은 열정적이고 창의적이며, 다양한 가능성을 탐색하고 사람들과의 깊은 관계를 중요시합니다. 이들은 상상력이 풍부하고, 새로운 아이디어와 프로젝트에 대해 열정을 가지며, 사람들과의 소통에서 에너지를 얻습니다. 자신과 타인의 가능성을 최대한으로 끌어내고, 변화를 주도하며 긍정적인 영향을 미치는 것을 선호합니다. 또한, 자율적이고 창의적인 방법으로 문제를 해결하는 데 뛰어난 능력을 보입니다."
  },
  {
    type: "ENTP",
    name: "발명가",
    description:
      "ENTP 유형은 창의적이고 논리적인 사고를 통해 새로운 아이디어를 제안하며 문제를 혁신적으로 해결합니다. 이들은 지적 호기심이 강하고, 다양한 관점에서 문제를 분석하며, 창의적인 해결책을 제시하는 것을 좋아합니다. 논리적이고 분석적인 접근을 통해 새로운 가능성을 탐색하며, 대화와 토론을 통해 아이디어를 발전시키는 것을 즐깁니다. 또한, 변화와 도전에 열려 있으며, 혁신적인 프로젝트를 추진하는 데 관심이 많습니다."
  },
  {
    type: "ESTJ",
    name: "경영자",
    description:
      "ESTJ 유형은 조직적이고 체계적인 접근을 통해 목표를 달성하며, 실용적이고 효율적인 방식으로 업무를 관리합니다. 이들은 현실적이고 구체적인 해결책을 선호하며, 책임감이 강하고 체계적인 계획을 수립하는 데 능숙합니다. 조직과 시스템을 효율적으로 운영하며, 자신의 역할과 책임을 성실히 수행합니다. 또한, 명확한 목표 설정과 실행을 통해 결과를 도출하는 데 뛰어난 능력을 보입니다."
  },
  {
    type: "ESFJ",
    name: "사교적인 외교관",
    description:
      "ESFJ 유형은 사회적 관계를 중시하며, 타인의 감정과 필요를 고려하여 적극적으로 지원합니다. 이들은 사교적이고 배려가 깊으며, 주변 사람들과의 관계에서 행복을 찾습니다. 사회적 조화를 중요시하며, 타인의 요구를 이해하고 이에 맞춰 행동하는 데 능숙합니다. 또한, 공동체의 분위기를 좋게 만들고, 사람들과의 긍정적인 상호작용을 통해 에너지를 얻습니다."
  },
  {
    type: "ENFJ",
    name: "주도적인 지도자",
    description:
      "ENFJ 유형은 강한 리더십과 통찰력을 가지고 사람들을 이끌며, 다른 사람들의 성장과 발전을 지원합니다. 이들은 사람들과의 깊은 관계를 중요시하며, 자신의 비전과 목표를 통해 팀이나 공동체를 발전시키는 데 집중합니다. 타인의 감정을 잘 이해하고, 그들의 잠재력을 발휘할 수 있도록 돕는 데 뛰어난 능력을 보입니다. 또한, 긍정적인 변화를 주도하며, 사회적 문제에 대한 해결책을 제시하는 것을 선호합니다."
  },
  {
    type: "ENTJ",
    name: "지휘관",
    description:
      "ENTJ 유형은 효율적이고 조직적인 사고를 통해 목표를 설정하고 이를 달성하기 위해 전략적으로 이끕니다. 이들은 강력한 리더십을 발휘하며, 복잡한 문제를 분석하고 해결하는 데 능숙합니다. 전략적이고 장기적인 계획을 세우고, 이를 실행하기 위한 자원과 사람들을 효과적으로 관리합니다. 또한, 목표 달성을 위해 체계적인 접근과 혁신적인 방법을 사용하여 높은 성과를 이끌어내는 것을 선호합니다."
  }
];
